driver-tests/bpelse/dynamicpartnerlink/correlation/CorrelationOnePropjbi/test/Rec_Reply_initNo/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">
  <soapenv:Body>
    <dat:helloObj>
      <!--Zero or more repetitions:-->
      <dat:string>foo</dat:string>
    </dat:helloObj>
  </soapenv:Body>
</soapenv:Envelope>