driver-tests/bpelse/dynamicpartnerlink/correlation/CorrelationOnePropjbi/test/Inv_PattReq_Pick_InitEmpty/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://xml.netbeans.org/schema/dataTypes.xsd" xmlns="http://xml.netbeans.org/schema/dataTypes.xsd">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <helloObj xmlns="http://xml.netbeans.org/schema/dataTypes.xsd">
    <ns0:string xmlns:ns0="http://xml.netbeans.org/schema/dataTypes.xsd">Test StringTest StringTest String</ns0:string>
  </helloObj>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
