driver-tests/bpelse/dynamicpartnerlink/correlation/CorrelationOnePropjbi/test/Invoke_EvntHandler2_InitNo/Output2.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <dat:helloObj xmlns:dat="http://xml.netbeans.org/schema/dataTypes.xsd">
      <dat:recursive/>
      <dat:string>OnEvent Branch Execution :Test String</dat:string>
      <dat:nonNegativeInteger>?200?</dat:nonNegativeInteger>
      <dat:byte>?2?</dat:byte>
      <dat:short>?1?</dat:short>
      <dat:int>?3?</dat:int>
      <dat:long>?10?</dat:long>
      <dat:negativeInteger>?-201?</dat:negativeInteger>
      <dat:dateTime>?2008-09-28T18:49:45?</dat:dateTime>
      <dat:nonPositiveInteger>?-200?</dat:nonPositiveInteger>
      <dat:duration>?P1Y2M6DT14H25M13S?</dat:duration>
      <dat:ENTITIES>??string??</dat:ENTITIES>
      <dat:double>?1.051732E7?</dat:double>
      <dat:ENTITY>?string?</dat:ENTITY>
      <dat:float>?1.5E2?</dat:float>
      <dat:Element30>??string??</dat:Element30>
      <dat:integer>100</dat:integer>
      <dat:decimal>1000.00</dat:decimal>
      <dat:boolean>false</dat:boolean>
      <dat:Element2>?string?</dat:Element2>
      <dat:Element1>?string?</dat:Element1>
      <dat:Element29>?string?</dat:Element29>
      <dat:Element28>?string?</dat:Element28>
      <dat:Element27>?string?</dat:Element27>
      <dat:Element26>?string?</dat:Element26>
      <dat:Element25>??string? ?string??</dat:Element25>
      <dat:Element24>?string?</dat:Element24>
      <dat:Element23>?string?</dat:Element23>
      <dat:Element22>?token?</dat:Element22>
      <dat:Element20>?qname?</dat:Element20>
      <dat:Element19>?http://www.any.com/circum/regemque?</dat:Element19>
      <dat:Element18>?bmltYm9ydW0=?</dat:Element18>
      <dat:Element17>?6672656D756E74?</dat:Element17>
      <dat:Element16>?--09-07:00?</dat:Element16>
      <dat:Element15>?---14?</dat:Element15>
      <dat:Element14>?--03-18?</dat:Element14>
      <dat:Element13>?2018-08:00?</dat:Element13>
      <dat:Element12>?2017-11-07:00?</dat:Element12>
      <dat:Element11>?2014-06-10-07:00?</dat:Element11>
      <dat:Element10>?23:56:46-08:00?</dat:Element10>
    </dat:helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
